## staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 15 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| update   | `aws_eks_addon.coredns`                                        |
|          | `aws_eks_addon.ebs_driver`                                     |
|          | `aws_eks_addon.kube_proxy`                                     |
|          | `aws_eks_addon.vpc_cni`                                        |
|          | `aws_eks_cluster.notification-canada-ca-eks-cluster`           |
|          | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s` |
|          | `aws_iam_openid_connect_provider.notification-canada-ca`       |
|          | `aws_iam_role.admin`                                           |
|          | `aws_iam_role.api`                                             |
|          | `aws_iam_role.celery`                                          |
|          | `aws_iam_role.document_download`                               |
|          | `aws_iam_role.notification-service-account-role`               |
|          | `aws_iam_role.secrets_csi_blazer`                              |
|          | `aws_iam_role.secrets_csi_nginx`                               |
|          | `module.iam_assumable_role_karpenter.aws_iam_role.this[0]`     |
| recreate | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.notify_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "notify_cluster" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "notification-canada-ca-staging-eks-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # data.aws_iam_policy_document.assume_role_policy_admin will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role_policy_admin" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:notification-canada-ca:notify-admin",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.assume_role_policy_api will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role_policy_api" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:notification-canada-ca:notify-api",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.assume_role_policy_celery will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role_policy_celery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:notification-canada-ca:notify-celery",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.assume_role_policy_document_download will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role_policy_document_download" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:notification-canada-ca:notify-document-download",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.eks-assume-role-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "eks-assume-role-policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:notification-canada-ca:notification-service-account",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.secrets_csi_assume_role_policy_blazer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_blazer" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:tools:blazer",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.secrets_csi_assume_role_policy_nginx will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_nginx" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:nginx:ingress-nginx-ingress",
                ]
              + variable = "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_security_group.eks-securitygroup-rds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_security_group" "eks-securitygroup-rds" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = "sg-0e2c3ef6c5c75b74c"
      + name        = (known after apply)
      + tags        = (known after apply)
      + vpc_id      = (known after apply)
    }

  # data.tls_certificate.notification-canada-ca will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "notification-canada-ca" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
    }

  # aws_eks_addon.coredns will be updated in-place
  ~ resource "aws_eks_addon" "coredns" {
      ~ addon_version               = "v1.11.3-eksbuild.1" -> "v1.11.4-eksbuild.2"
        id                          = "notification-canada-ca-staging-eks-cluster:coredns"
        tags                        = {}
        # (11 unchanged attributes hidden)
    }

  # aws_eks_addon.ebs_driver will be updated in-place
  ~ resource "aws_eks_addon" "ebs_driver" {
      ~ addon_version               = "v1.35.0-eksbuild.1" -> "v1.42.0-eksbuild.1"
        id                          = "notification-canada-ca-staging-eks-cluster:aws-ebs-csi-driver"
        tags                        = {}
        # (10 unchanged attributes hidden)
    }

  # aws_eks_addon.kube_proxy will be updated in-place
  ~ resource "aws_eks_addon" "kube_proxy" {
      ~ addon_version               = "v1.31.0-eksbuild.5" -> "v1.32.0-eksbuild.2"
        id                          = "notification-canada-ca-staging-eks-cluster:kube-proxy"
        tags                        = {}
        # (11 unchanged attributes hidden)
    }

  # aws_eks_addon.vpc_cni will be updated in-place
  ~ resource "aws_eks_addon" "vpc_cni" {
      ~ addon_version               = "v1.18.5-eksbuild.1" -> "v1.19.2-eksbuild.5"
        id                          = "notification-canada-ca-staging-eks-cluster:vpc-cni"
        tags                        = {}
        # (11 unchanged attributes hidden)
    }

  # aws_eks_cluster.notification-canada-ca-eks-cluster will be updated in-place
  ~ resource "aws_eks_cluster" "notification-canada-ca-eks-cluster" {
        id                            = "notification-canada-ca-staging-eks-cluster"
        name                          = "notification-canada-ca-staging-eks-cluster"
        tags                          = {
            "CostCenter" = "notification-canada-ca-staging"
            "Name"       = "notification-canada-ca"
        }
      ~ version                       = "1.31" -> "1.32"
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                     = "notification-canada-ca-staging-eks-cluster:notification-canada-ca-staging-eks-primary-node-group-k8s"
      ~ release_version        = "1.31.5-20250317" -> "1.32.1-20250419"
        tags                   = {
            "CostCenter"             = "notification-canada-ca-staging"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-staging-eks-cluster"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_iam_openid_connect_provider.notification-canada-ca will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "notification-canada-ca" {
        id              = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
        tags            = {}
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role.admin will be updated in-place
  ~ resource "aws_iam_role" "admin" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:notification-canada-ca:notify-admin"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "admin-eks-role"
        name                  = "admin-eks-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.api will be updated in-place
  ~ resource "aws_iam_role" "api" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:notification-canada-ca:notify-api"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "api-eks-role"
        name                  = "api-eks-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.celery will be updated in-place
  ~ resource "aws_iam_role" "celery" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:notification-canada-ca:notify-celery"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "celery-eks-role"
        name                  = "celery-eks-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.document_download will be updated in-place
  ~ resource "aws_iam_role" "document_download" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:notification-canada-ca:notify-document-download"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "document-download-eks-role"
        name                  = "document-download-eks-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.notification-service-account-role will be updated in-place
  ~ resource "aws_iam_role" "notification-service-account-role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:notification-canada-ca:notification-service-account"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "notification-service-account-role"
        name                  = "notification-service-account-role"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.secrets_csi_blazer will be updated in-place
  ~ resource "aws_iam_role" "secrets_csi_blazer" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:tools:blazer"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "secrets-csi-role-blazer"
        name                  = "secrets-csi-role-blazer"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.secrets_csi_nginx will be updated in-place
  ~ resource "aws_iam_role" "secrets_csi_nginx" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:nginx:ingress-nginx-ingress"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "secrets-csi-role-nginx"
        name                  = "secrets-csi-role-nginx"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:EKS_KARPENTER_AMI_ID-RMKHzX" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:EKS_KARPENTER_AMI_ID-RMKHzX|terraform-20250430173405756900000003" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20250430173405756900000003" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.iam_assumable_role_karpenter.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement (known after apply)
    }

  # module.iam_assumable_role_karpenter.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "sts:TagSession",
                          - "sts:AssumeRoleWithWebIdentity",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "karpenter-controller-eks"
        name                  = "karpenter-controller-eks"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 15 to change, 1 to destroy.

Changes to Outputs:
  ~ eks_cluster_endpoint                      = "https://8E890C7C4012094A93B6FDD00681B54C.sk1.ca-central-1.eks.amazonaws.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.oom-errors[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
